rails final/blog/app/controllers/entries_controller.rb

SELECT `entries`.* FROM `entries`
---
  def index
    @entries = Entry.all

INSERT INTO `entries` (`title`, `body`, `user_id`, `created_at`, `updated_at`) VALUES ('as bybi noriu zozolint', 'e tu duxas', 2, '2019-12-17 17:54:59.551658', '2019-12-17 17:54:59.551658')
---
  def create
    @entry = Entry.new(entry_params)
    @entry.user = current_user
    respond_to do |format|
      if @entry.save

UPDATE `entries` SET `entries`.`body` = 'matorka dauzals yra, cieskai poxui yra, pajarskas karves augina. \r\nlorem ipsum, ignelis gaus pizdipsum.', `entries`.`updated_at` = '2019-12-17 19:59:17.754745' WHERE `entries`.`id` = 1
---
  def update
    respond_to do |format|
      if @entry.update(entry_params)

DELETE FROM `entries` WHERE `entries`.`id` = 1
---
  def destroy
    @entry.destroy

SELECT `entries`.* FROM `entries` WHERE `entries`.`id` = 8 LIMIT 1
---
  def set_entry
    @entry = Entry.find(params[:id])